{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### This code is to explore the relationship between pathway from website and reaction in Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import py2neo\n",
    "import pandas as pd\n",
    "import importlib\n",
    "import progressbar\n",
    "import numpy as np"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Initialize connection to database\n",
    "driver = GraphDatabase.driver('bolt://localhost:7687', \n",
    "                              auth=('neo4j', '19992005zwj'), \n",
    "                              encrypted=False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "dic_pathway = np.load('./dicCVD_pathway_neo4j.npy', allow_pickle=True).item()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### About pathway from website"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Relationship with reaction"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [],
   "source": [
    "reac = []\n",
    "path_reac = {}\n",
    "for i in dic_pathway:\n",
    "    for j in dic_pathway[i]:\n",
    "        path_reac[j] = []\n",
    "        query = 'MATCH (n:Pathway) WHERE n.stId =\\'' + j +\\\n",
    "                '\\' WITH n MATCH (n:Pathway) -[r]- (m:ReactionLikeEvent) RETURN m.stId'\n",
    "        with driver.session() as session:\n",
    "            info = session.run(query)\n",
    "            for item in info:\n",
    "                path_reac[j].append(item.values()[0])\n",
    "                if item.values()[0] not in reac:\n",
    "                    reac.append(item.values()[0])\n",
    "                   "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'R-HSA-9008059': ['R-HSA-9008694',\n",
       "  'R-HSA-9009910',\n",
       "  'R-HSA-9008692',\n",
       "  'R-HSA-9009072',\n",
       "  'R-HSA-9012689',\n",
       "  'R-HSA-9008894',\n",
       "  'R-HSA-9012542',\n",
       "  'R-HSA-9008696',\n",
       "  'R-HSA-9008928',\n",
       "  'R-HSA-9008577',\n",
       "  'R-HSA-8848335',\n",
       "  'R-HSA-9008684',\n",
       "  'R-HSA-9012556',\n",
       "  'R-HSA-9008587'],\n",
       " 'R-HSA-9029569': ['R-HSA-9035279',\n",
       "  'R-HSA-9024334',\n",
       "  'R-HSA-9618394',\n",
       "  'R-HSA-9618392',\n",
       "  'R-HSA-9024386',\n",
       "  'R-HSA-9035143',\n",
       "  'R-HSA-9024326',\n",
       "  'R-HSA-9624925',\n",
       "  'R-HSA-9031512',\n",
       "  'R-HSA-9029531',\n",
       "  'R-HSA-9605057',\n",
       "  'R-HSA-9035167',\n",
       "  'R-HSA-9031518',\n",
       "  'R-HSA-9029521',\n",
       "  'R-HSA-9035281',\n",
       "  'R-HSA-9038545',\n",
       "  'R-HSA-9029591',\n",
       "  'R-HSA-9031510',\n",
       "  'R-HSA-9024361',\n",
       "  'R-HSA-9618486',\n",
       "  'R-HSA-9035180',\n",
       "  'R-HSA-9029551',\n",
       "  'R-HSA-9035169',\n",
       "  'R-HSA-9031521',\n",
       "  'R-HSA-9657786',\n",
       "  'R-HSA-9031522',\n",
       "  'R-HSA-9657791',\n",
       "  'R-HSA-9031527',\n",
       "  'R-HSA-9605052',\n",
       "  'R-HSA-9029561',\n",
       "  'R-HSA-9624353',\n",
       "  'R-HSA-9035133',\n",
       "  'R-HSA-9657767',\n",
       "  'R-HSA-9618407',\n",
       "  'R-HSA-9618405',\n",
       "  'R-HSA-9035185',\n",
       "  'R-HSA-9029555',\n",
       "  'R-HSA-9618479',\n",
       "  'R-HSA-9619756',\n",
       "  'R-HSA-9624365'],\n",
       " 'R-HSA-9018679': ['R-HSA-9018880'],\n",
       " 'R-HSA-2682334': ['R-HSA-3928597',\n",
       "  'R-HSA-3928646',\n",
       "  'R-HSA-3928624',\n",
       "  'R-HSA-3928578',\n",
       "  'R-HSA-3928591',\n",
       "  'R-HSA-3928584'],\n",
       " 'R-HSA-9033658': [],\n",
       " 'R-HSA-216083': ['R-HSA-216061',\n",
       "  'R-HSA-199032',\n",
       "  'R-HSA-4088264',\n",
       "  'R-HSA-4086216',\n",
       "  'R-HSA-114560',\n",
       "  'R-HSA-114563',\n",
       "  'R-HSA-2473511',\n",
       "  'R-HSA-216064',\n",
       "  'R-HSA-210304',\n",
       "  'R-HSA-216069',\n",
       "  'R-HSA-216068',\n",
       "  'R-HSA-199050',\n",
       "  'R-HSA-216072',\n",
       "  'R-HSA-4084912',\n",
       "  'R-HSA-216076',\n",
       "  'R-HSA-4084910',\n",
       "  'R-HSA-216082',\n",
       "  'R-HSA-204434',\n",
       "  'R-HSA-4084903',\n",
       "  'R-HSA-349593',\n",
       "  'R-HSA-198941',\n",
       "  'R-HSA-4088220',\n",
       "  'R-HSA-4088218',\n",
       "  'R-HSA-349603',\n",
       "  'R-HSA-2327695',\n",
       "  'R-HSA-4085133',\n",
       "  'R-HSA-2426259',\n",
       "  'R-HSA-2470555',\n",
       "  'R-HSA-2484965',\n",
       "  'R-HSA-4539779',\n",
       "  'R-HSA-2467436',\n",
       "  'R-HSA-265422',\n",
       "  'R-HSA-265423',\n",
       "  'R-HSA-265428',\n",
       "  'R-HSA-265429',\n",
       "  'R-HSA-202706',\n",
       "  'R-HSA-202704',\n",
       "  'R-HSA-265424',\n",
       "  'R-HSA-2752125',\n",
       "  'R-HSA-265425',\n",
       "  'R-HSA-265426',\n",
       "  'R-HSA-265427',\n",
       "  'R-HSA-2752115',\n",
       "  'R-HSA-202718',\n",
       "  'R-HSA-2752118',\n",
       "  'R-HSA-4085087',\n",
       "  'R-HSA-202727',\n",
       "  'R-HSA-4085083',\n",
       "  'R-HSA-4088281',\n",
       "  'R-HSA-216043',\n",
       "  'R-HSA-216040',\n",
       "  'R-HSA-216045',\n",
       "  'R-HSA-4086223',\n",
       "  'R-HSA-216050'],\n",
       " 'R-HSA-211935': ['R-HSA-211983',\n",
       "  'R-HSA-211924',\n",
       "  'R-HSA-211904',\n",
       "  'R-HSA-76466'],\n",
       " 'R-HSA-2022377': ['R-HSA-2022398',\n",
       "  'R-HSA-2022399',\n",
       "  'R-HSA-2022396',\n",
       "  'R-HSA-9619024',\n",
       "  'R-HSA-2022393',\n",
       "  'R-HSA-9614933',\n",
       "  'R-HSA-9619034',\n",
       "  'R-HSA-2022383',\n",
       "  'R-HSA-2022412',\n",
       "  'R-HSA-2065357',\n",
       "  'R-HSA-2022381',\n",
       "  'R-HSA-2065355',\n",
       "  'R-HSA-2022378',\n",
       "  'R-HSA-2022411',\n",
       "  'R-HSA-2022379',\n",
       "  'R-HSA-2028294',\n",
       "  'R-HSA-2022405',\n",
       "  'R-HSA-2022403',\n",
       "  'R-HSA-2022368',\n",
       "  'R-HSA-8851929'],\n",
       " 'R-HSA-3560801': ['R-HSA-3560802'],\n",
       " 'R-HSA-1793185': [],\n",
       " 'R-HSA-9018678': [],\n",
       " 'R-HSA-5617472': ['R-HSA-5617877',\n",
       "  'R-HSA-5617492',\n",
       "  'R-HSA-5617431',\n",
       "  'R-HSA-5617879',\n",
       "  'R-HSA-5621010',\n",
       "  'R-HSA-5617874',\n",
       "  'R-HSA-6810159',\n",
       "  'R-HSA-6810158',\n",
       "  'R-HSA-5617887',\n",
       "  'R-HSA-5617881',\n",
       "  'R-HSA-5617668',\n",
       "  'R-HSA-5617479',\n",
       "  'R-HSA-5617862',\n",
       "  'R-HSA-6810161',\n",
       "  'R-HSA-5617859',\n",
       "  'R-HSA-5617485',\n",
       "  'R-HSA-5617484',\n",
       "  'R-HSA-5617676',\n",
       "  'R-HSA-5693644',\n",
       "  'R-HSA-5617486',\n",
       "  'R-HSA-5617672',\n",
       "  'R-HSA-5617864',\n",
       "  'R-HSA-5617483',\n",
       "  'R-HSA-5617867',\n",
       "  'R-HSA-5621002',\n",
       "  'R-HSA-5617866',\n",
       "  'R-HSA-5617652',\n",
       "  'R-HSA-5617462',\n",
       "  'R-HSA-5617457',\n",
       "  'R-HSA-5617458',\n",
       "  'R-HSA-5617650',\n",
       "  'R-HSA-5617661',\n",
       "  'R-HSA-5617471',\n",
       "  'R-HSA-5617855',\n",
       "  'R-HSA-5617445',\n",
       "  'R-HSA-5617446',\n",
       "  'R-HSA-5617452',\n",
       "  'R-HSA-5617454',\n",
       "  'R-HSA-6810139',\n",
       "  'R-HSA-5617641',\n",
       "  'R-HSA-5617896',\n",
       "  'R-HSA-5617643',\n",
       "  'R-HSA-5617642'],\n",
       " 'R-HSA-8866906': ['R-HSA-8864729', 'R-HSA-8864718'],\n",
       " 'R-HSA-8864260': ['R-HSA-8869575', 'R-HSA-8869590', 'R-HSA-8869580'],\n",
       " 'R-HSA-8866910': ['R-HSA-8864698',\n",
       "  'R-HSA-8864412',\n",
       "  'R-HSA-8864989',\n",
       "  'R-HSA-8864381',\n",
       "  'R-HSA-8864433',\n",
       "  'R-HSA-8864690',\n",
       "  'R-HSA-8864466',\n",
       "  'R-HSA-8937369',\n",
       "  'R-HSA-8864936',\n",
       "  'R-HSA-8864426',\n",
       "  'R-HSA-8864395',\n",
       "  'R-HSA-8874797',\n",
       "  'R-HSA-8864431',\n",
       "  'R-HSA-378978',\n",
       "  'R-HSA-8864737',\n",
       "  'R-HSA-8874789',\n",
       "  'R-HSA-8864453',\n",
       "  'R-HSA-8864999'],\n",
       " 'R-HSA-5619053': ['R-HSA-5625674'],\n",
       " 'R-HSA-5678420': ['R-HSA-5678418'],\n",
       " 'R-HSA-5619092': ['R-HSA-5661039'],\n",
       " 'R-HSA-5682113': ['R-HSA-5682111'],\n",
       " 'R-HSA-5619039': ['R-HSA-5623806'],\n",
       " 'R-HSA-5619108': ['R-HSA-5627891'],\n",
       " 'R-HSA-8986944': ['R-HSA-9615570',\n",
       "  'R-HSA-9615571',\n",
       "  'R-HSA-9022315',\n",
       "  'R-HSA-9615536',\n",
       "  'R-HSA-9006508',\n",
       "  'R-HSA-9022764',\n",
       "  'R-HSA-9615829',\n",
       "  'R-HSA-9021953',\n",
       "  'R-HSA-9615801',\n",
       "  'R-HSA-9006503',\n",
       "  'R-HSA-9021945',\n",
       "  'R-HSA-9615554',\n",
       "  'R-HSA-9022456',\n",
       "  'R-HSA-9022872',\n",
       "  'R-HSA-9022770',\n",
       "  'R-HSA-9022453',\n",
       "  'R-HSA-9022870'],\n",
       " 'R-HSA-3785653': ['R-HSA-3791349', 'R-HSA-3797226'],\n",
       " 'R-HSA-9629232': ['R-HSA-9629245'],\n",
       " 'R-HSA-5619066': ['R-HSA-5625574'],\n",
       " 'R-HSA-1980145': [],\n",
       " 'R-HSA-1912408': ['R-HSA-1912413',\n",
       "  'R-HSA-1912412',\n",
       "  'R-HSA-1912415',\n",
       "  'R-HSA-1606682',\n",
       "  'R-HSA-1912409',\n",
       "  'R-HSA-1912410',\n",
       "  'R-HSA-1912407',\n",
       "  'R-HSA-1912406',\n",
       "  'R-HSA-1912401',\n",
       "  'R-HSA-9604703',\n",
       "  'R-HSA-9604831',\n",
       "  'R-HSA-9604829',\n",
       "  'R-HSA-4395227',\n",
       "  'R-HSA-4395231',\n",
       "  'R-HSA-9017835',\n",
       "  'R-HSA-9021357',\n",
       "  'R-HSA-4395236',\n",
       "  'R-HSA-1912368',\n",
       "  'R-HSA-9604834',\n",
       "  'R-HSA-1912364',\n",
       "  'R-HSA-1912367',\n",
       "  'R-HSA-1912366',\n",
       "  'R-HSA-1912363',\n",
       "  'R-HSA-1912362',\n",
       "  'R-HSA-1606561',\n",
       "  'R-HSA-1912416',\n",
       "  'R-HSA-9021364',\n",
       "  'R-HSA-9604719'],\n",
       " 'R-HSA-1566948': ['R-HSA-2129375',\n",
       "  'R-HSA-2161293',\n",
       "  'R-HSA-2129357',\n",
       "  'R-HSA-2129353',\n",
       "  'R-HSA-2129385',\n",
       "  'R-HSA-2328037',\n",
       "  'R-HSA-2129362'],\n",
       " 'R-HSA-9656223': [],\n",
       " 'R-HSA-6802949': [],\n",
       " 'R-HSA-5655302': ['R-HSA-5655240',\n",
       "  'R-HSA-5655290',\n",
       "  'R-HSA-1839094',\n",
       "  'R-HSA-5655263',\n",
       "  'R-HSA-5655326',\n",
       "  'R-HSA-5655278',\n",
       "  'R-HSA-1839098',\n",
       "  'R-HSA-5655266',\n",
       "  'R-HSA-5655269',\n",
       "  'R-HSA-1839100'],\n",
       " 'R-HSA-1839117': ['R-HSA-1839107',\n",
       "  'R-HSA-1888198',\n",
       "  'R-HSA-1839110',\n",
       "  'R-HSA-1839078',\n",
       "  'R-HSA-1839114',\n",
       "  'R-HSA-1839112',\n",
       "  'R-HSA-1839080',\n",
       "  'R-HSA-1839091',\n",
       "  'R-HSA-1839095',\n",
       "  'R-HSA-1839031',\n",
       "  'R-HSA-1839067',\n",
       "  'R-HSA-1839065',\n",
       "  'R-HSA-1839039',\n",
       "  'R-HSA-1839102'],\n",
       " 'R-HSA-1839122': ['R-HSA-2023456',\n",
       "  'R-HSA-2023460',\n",
       "  'R-HSA-2023451',\n",
       "  'R-HSA-2023455'],\n",
       " 'R-HSA-1226099': [],\n",
       " 'R-HSA-9674415': [],\n",
       " 'R-HSA-1839126': [],\n",
       " 'R-HSA-9646304': ['R-HSA-9646295'],\n",
       " 'R-HSA-9646303': ['R-HSA-9646295'],\n",
       " 'R-HSA-8951664': ['R-HSA-8956040',\n",
       "  'R-HSA-8956234',\n",
       "  'R-HSA-8956106',\n",
       "  'R-HSA-8956045',\n",
       "  'R-HSA-8956099',\n",
       "  'R-HSA-8951751',\n",
       "  'R-HSA-8956103',\n",
       "  'R-HSA-8956184',\n",
       "  'R-HSA-8955289',\n",
       "  'R-HSA-8951644',\n",
       "  'R-HSA-8956050',\n",
       "  'R-HSA-8951764',\n",
       "  'R-HSA-8955285',\n",
       "  'R-HSA-8951766',\n",
       "  'R-HSA-8951656',\n",
       "  'R-HSA-8956200',\n",
       "  'R-HSA-8955241',\n",
       "  'R-HSA-8952618',\n",
       "  'R-HSA-8952620',\n",
       "  'R-HSA-8952044',\n",
       "  'R-HSA-8956140',\n",
       "  'R-HSA-8951661',\n",
       "  'R-HSA-8955245',\n",
       "  'R-HSA-8951648',\n",
       "  'R-HSA-5690808',\n",
       "  'R-HSA-8952039',\n",
       "  'R-HSA-8956025',\n",
       "  'R-HSA-8956026',\n",
       "  'R-HSA-8952638',\n",
       "  'R-HSA-8952639',\n",
       "  'R-HSA-8956031'],\n",
       " 'R-HSA-5603027': ['R-HSA-5262921'],\n",
       " 'R-HSA-5620920': [],\n",
       " 'R-HSA-3656253': ['R-HSA-3656257',\n",
       "  'R-HSA-9036285',\n",
       "  'R-HSA-9036283',\n",
       "  'R-HSA-3656261'],\n",
       " 'R-HSA-8851708': ['R-HSA-8853320', 'R-HSA-8851710'],\n",
       " 'R-HSA-6781823': ['R-HSA-6781833',\n",
       "  'R-HSA-6781818',\n",
       "  'R-HSA-6781867',\n",
       "  'R-HSA-6781840',\n",
       "  'R-HSA-6781824',\n",
       "  'R-HSA-6782004',\n",
       "  'R-HSA-6782069'],\n",
       " 'R-HSA-5260271': [],\n",
       " 'R-HSA-5619095': ['R-HSA-5661188'],\n",
       " 'R-HSA-5624958': ['R-HSA-5624954',\n",
       "  'R-HSA-5624953',\n",
       "  'R-HSA-5638012',\n",
       "  'R-HSA-5624956'],\n",
       " 'R-HSA-5602358': [],\n",
       " 'R-HSA-5619058': ['R-HSA-5661198'],\n",
       " 'R-HSA-5602415': ['R-HSA-5607838'],\n",
       " 'R-HSA-5603041': ['R-HSA-5602672', 'R-HSA-5602353'],\n",
       " 'R-HSA-5603037': ['R-HSA-5602603', 'R-HSA-5602472'],\n",
       " 'R-HSA-9022927': ['R-HSA-9022934',\n",
       "  'R-HSA-9022935',\n",
       "  'R-HSA-9022942',\n",
       "  'R-HSA-9022941'],\n",
       " 'R-HSA-9022699': ['R-HSA-9022728',\n",
       "  'R-HSA-9022734',\n",
       "  'R-HSA-9017921',\n",
       "  'R-HSA-9021954',\n",
       "  'R-HSA-9020504',\n",
       "  'R-HSA-9006490',\n",
       "  'R-HSA-9022365',\n",
       "  'R-HSA-9022175',\n",
       "  'R-HSA-9022359',\n",
       "  'R-HSA-9006507',\n",
       "  'R-HSA-9005994',\n",
       "  'R-HSA-9022186',\n",
       "  'R-HSA-9020513',\n",
       "  'R-HSA-9017954',\n",
       "  'R-HSA-9005988',\n",
       "  'R-HSA-9006585',\n",
       "  'R-HSA-9021946',\n",
       "  'R-HSA-9023549',\n",
       "  'R-HSA-9021948',\n",
       "  'R-HSA-8986940',\n",
       "  'R-HSA-9006588',\n",
       "  'R-HSA-9021951',\n",
       "  'R-HSA-8986943',\n",
       "  'R-HSA-9023345',\n",
       "  'R-HSA-9023346',\n",
       "  'R-HSA-9023538'],\n",
       " 'R-HSA-5358508': [],\n",
       " 'R-HSA-6782135': ['R-HSA-6782138',\n",
       "  'R-HSA-6782204',\n",
       "  'R-HSA-6782141',\n",
       "  'R-HSA-6782224',\n",
       "  'R-HSA-6782211',\n",
       "  'R-HSA-6782131'],\n",
       " 'R-HSA-3238698': ['R-HSA-3247839',\n",
       "  'R-HSA-3781943',\n",
       "  'R-HSA-3247836',\n",
       "  'R-HSA-3781941',\n",
       "  'R-HSA-3247837',\n",
       "  'R-HSA-3247849',\n",
       "  'R-HSA-3238694',\n",
       "  'R-HSA-3247847',\n",
       "  'R-HSA-3247844',\n",
       "  'R-HSA-3247843',\n",
       "  'R-HSA-3238691',\n",
       "  'R-HSA-3247840'],\n",
       " 'R-HSA-9022692': ['R-HSA-9615501',\n",
       "  'R-HSA-9006992',\n",
       "  'R-HSA-9021182',\n",
       "  'R-HSA-9021183',\n",
       "  'R-HSA-9023132',\n",
       "  'R-HSA-8986939',\n",
       "  'R-HSA-8986937',\n",
       "  'R-HSA-9615490',\n",
       "  'R-HSA-9018594',\n",
       "  'R-HSA-9021888',\n",
       "  'R-HSA-9022625',\n",
       "  'R-HSA-9022314',\n",
       "  'R-HSA-9005995',\n",
       "  'R-HSA-9023592'],\n",
       " 'R-HSA-9616334': ['R-HSA-9629917',\n",
       "  'R-HSA-9629166',\n",
       "  'R-HSA-9628756',\n",
       "  'R-HSA-9628758',\n",
       "  'R-HSA-9628737'],\n",
       " 'R-HSA-8936459': ['R-HSA-8936584',\n",
       "  'R-HSA-8937097',\n",
       "  'R-HSA-8937037',\n",
       "  'R-HSA-8934735',\n",
       "  'R-HSA-8938176',\n",
       "  'R-HSA-8938328',\n",
       "  'R-HSA-8937113',\n",
       "  'R-HSA-8938201',\n",
       "  'R-HSA-8937050',\n",
       "  'R-HSA-8936989',\n",
       "  'R-HSA-8937118',\n",
       "  'R-HSA-8936979',\n",
       "  'R-HSA-8934742',\n",
       "  'R-HSA-8936599',\n",
       "  'R-HSA-8938199',\n",
       "  'R-HSA-8936616',\n",
       "  'R-HSA-8936621',\n",
       "  'R-HSA-8938158',\n",
       "  'R-HSA-8936608',\n",
       "  'R-HSA-8936481',\n",
       "  'R-HSA-8938338',\n",
       "  'R-HSA-8936995',\n",
       "  'R-HSA-8938022',\n",
       "  'R-HSA-8938150',\n",
       "  'R-HSA-8937016',\n",
       "  'R-HSA-8935740',\n",
       "  'R-HSA-8937022',\n",
       "  'R-HSA-8938174',\n",
       "  'R-HSA-8935730',\n",
       "  'R-HSA-8938034',\n",
       "  'R-HSA-8935731',\n",
       "  'R-HSA-8935732',\n",
       "  'R-HSA-8936628'],\n",
       " 'R-HSA-9605310': [],\n",
       " 'R-HSA-2219528': [],\n",
       " 'R-HSA-5628897': ['R-HSA-71682',\n",
       "  'R-HSA-2318752',\n",
       "  'R-HSA-5632914',\n",
       "  'R-HSA-5632732',\n",
       "  'R-HSA-5632924',\n",
       "  'R-HSA-70475',\n",
       "  'R-HSA-5631903',\n",
       "  'R-HSA-163214',\n",
       "  'R-HSA-5629189',\n",
       "  'R-HSA-5631941',\n",
       "  'R-HSA-70609',\n",
       "  'R-HSA-198609',\n",
       "  'R-HSA-2321904',\n",
       "  'R-HSA-5629187',\n",
       "  'R-HSA-5632386',\n",
       "  'R-HSA-5631885',\n",
       "  'R-HSA-5632393',\n",
       "  'R-HSA-5632759',\n",
       "  'R-HSA-5632887',\n",
       "  'R-HSA-70377',\n",
       "  'R-HSA-5632892',\n",
       "  'R-HSA-5632766',\n",
       "  'R-HSA-3341343',\n",
       "  'R-HSA-3341277',\n",
       "  'R-HSA-73646',\n",
       "  'R-HSA-5628901',\n",
       "  'R-HSA-5632993',\n",
       "  'R-HSA-5628899',\n",
       "  'R-HSA-380979',\n",
       "  'R-HSA-5632738',\n",
       "  'R-HSA-165179',\n",
       "  'R-HSA-380927',\n",
       "  'R-HSA-5628905',\n",
       "  'R-HSA-5632939'],\n",
       " 'R-HSA-9616333': [],\n",
       " 'R-HSA-6781827': ['R-HSA-6782234'],\n",
       " 'R-HSA-3248023': ['R-HSA-3244605', 'R-HSA-3245943'],\n",
       " 'R-HSA-9012852': [],\n",
       " 'R-HSA-9609646': [],\n",
       " 'R-HSA-8878166': ['R-HSA-9007816',\n",
       "  'R-HSA-9008456',\n",
       "  'R-HSA-9008832',\n",
       "  'R-HSA-9009282',\n",
       "  'R-HSA-9008839',\n",
       "  'R-HSA-9008412',\n",
       "  'R-HSA-8865425',\n",
       "  'R-HSA-8985343',\n",
       "  'R-HSA-9008433',\n",
       "  'R-HSA-9007860',\n",
       "  'R-HSA-9008822'],\n",
       " 'R-HSA-9033241': ['R-HSA-9033514',\n",
       "  'R-HSA-9033485',\n",
       "  'R-HSA-9033516',\n",
       "  'R-HSA-9033505',\n",
       "  'R-HSA-9033509',\n",
       "  'R-HSA-9033478',\n",
       "  'R-HSA-9033240',\n",
       "  'R-HSA-8953946',\n",
       "  'R-HSA-9033499',\n",
       "  'R-HSA-9033533',\n",
       "  'R-HSA-8953917',\n",
       "  'R-HSA-9033233',\n",
       "  'R-HSA-9033232',\n",
       "  'R-HSA-9033235',\n",
       "  'R-HSA-9033491',\n",
       "  'R-HSA-9033236',\n",
       "  'R-HSA-9033527',\n",
       "  'R-HSA-9033526',\n",
       "  'R-HSA-9033238'],\n",
       " 'R-HSA-195258': [],\n",
       " 'R-HSA-5668541': ['R-HSA-5668520',\n",
       "  'R-HSA-5668543',\n",
       "  'R-HSA-5668414',\n",
       "  'R-HSA-5668481',\n",
       "  'R-HSA-5668417',\n",
       "  'R-HSA-5668467',\n",
       "  'R-HSA-5668404',\n",
       "  'R-HSA-5668454',\n",
       "  'R-HSA-5668534'],\n",
       " 'R-HSA-9615017': ['R-HSA-9622738',\n",
       "  'R-HSA-9623059',\n",
       "  'R-HSA-9622737',\n",
       "  'R-HSA-9625749',\n",
       "  'R-HSA-9623192',\n",
       "  'R-HSA-9625693',\n",
       "  'R-HSA-9625346',\n",
       "  'R-HSA-9623427',\n",
       "  'R-HSA-9625091',\n",
       "  'R-HSA-9623168',\n",
       "  'R-HSA-9617927',\n",
       "  'R-HSA-9625863',\n",
       "  'R-HSA-9622980',\n",
       "  'R-HSA-9625092',\n",
       "  'R-HSA-9622981',\n",
       "  'R-HSA-9623240',\n",
       "  'R-HSA-9625101',\n",
       "  'R-HSA-9623280',\n",
       "  'R-HSA-9624624',\n",
       "  'R-HSA-9623281',\n",
       "  'R-HSA-9623415',\n",
       "  'R-HSA-9617972',\n",
       "  'R-HSA-9624611',\n",
       "  'R-HSA-9625699',\n",
       "  'R-HSA-9623072',\n",
       "  'R-HSA-9615015',\n",
       "  'R-HSA-9625124',\n",
       "  'R-HSA-9625828',\n",
       "  'R-HSA-9623018',\n",
       "  'R-HSA-9617832',\n",
       "  'R-HSA-9617833',\n",
       "  'R-HSA-9615023',\n",
       "  'R-HSA-9623023',\n",
       "  'R-HSA-9625324'],\n",
       " 'R-HSA-2046106': ['R-HSA-2066785',\n",
       "  'R-HSA-2066787',\n",
       "  'R-HSA-2066788',\n",
       "  'R-HSA-2046084',\n",
       "  'R-HSA-2046085',\n",
       "  'R-HSA-2046087',\n",
       "  'R-HSA-2046088',\n",
       "  'R-HSA-2046089',\n",
       "  'R-HSA-2046090',\n",
       "  'R-HSA-2046099',\n",
       "  'R-HSA-2046100',\n",
       "  'R-HSA-2066778',\n",
       "  'R-HSA-2066779',\n",
       "  'R-HSA-2066780',\n",
       "  'R-HSA-2066781'],\n",
       " 'R-HSA-392499': [],\n",
       " 'R-HSA-201451': ['R-HSA-201821',\n",
       "  'R-HSA-201648',\n",
       "  'R-HSA-201425',\n",
       "  'R-HSA-201457',\n",
       "  'R-HSA-201810',\n",
       "  'R-HSA-202604',\n",
       "  'R-HSA-201453',\n",
       "  'R-HSA-8858346',\n",
       "  'R-HSA-201422',\n",
       "  'R-HSA-201423',\n",
       "  'R-HSA-201476',\n",
       "  'R-HSA-8858369',\n",
       "  'R-HSA-201445',\n",
       "  'R-HSA-201472',\n",
       "  'R-HSA-202626',\n",
       "  'R-HSA-201475',\n",
       "  'R-HSA-201443'],\n",
       " 'R-HSA-9034013': ['R-HSA-9034016', 'R-HSA-9034714'],\n",
       " 'R-HSA-8981607': ['R-HSA-8981622',\n",
       "  'R-HSA-8981606',\n",
       "  'R-HSA-8981621',\n",
       "  'R-HSA-5340214',\n",
       "  'R-HSA-8981610',\n",
       "  'R-HSA-8982617'],\n",
       " 'R-HSA-2206296': ['R-HSA-9036046', 'R-HSA-2262743'],\n",
       " 'R-HSA-9034015': ['R-HSA-9603719'],\n",
       " 'R-HSA-9609310': [],\n",
       " 'R-HSA-8963889': ['R-HSA-6784648',\n",
       "  'R-HSA-8857928',\n",
       "  'R-HSA-6785178',\n",
       "  'R-HSA-5694109',\n",
       "  'R-HSA-6784620',\n",
       "  'R-HSA-6785213',\n",
       "  'R-HSA-6785181',\n",
       "  'R-HSA-8856525',\n",
       "  'R-HSA-6784861',\n",
       "  'R-HSA-6784622',\n",
       "  'R-HSA-6784676',\n",
       "  'R-HSA-6784628'],\n",
       " 'R-HSA-1296071': [],\n",
       " 'R-HSA-163560': ['R-HSA-163549',\n",
       "  'R-HSA-163551',\n",
       "  'R-HSA-5334794',\n",
       "  'R-HSA-163416',\n",
       "  'R-HSA-163418',\n",
       "  'R-HSA-8848338',\n",
       "  'R-HSA-8848339',\n",
       "  'R-HSA-163568',\n",
       "  'R-HSA-188467',\n",
       "  'R-HSA-163539',\n",
       "  'R-HSA-163602',\n",
       "  'R-HSA-163432',\n",
       "  'R-HSA-163595',\n",
       "  'R-HSA-163402',\n",
       "  'R-HSA-8848355',\n",
       "  'R-HSA-163489',\n",
       "  'R-HSA-163554'],\n",
       " 'R-HSA-9615249': [],\n",
       " 'R-HSA-9621032': [],\n",
       " 'R-HSA-3656237': ['R-HSA-3656267',\n",
       "  'R-HSA-9036290',\n",
       "  'R-HSA-3656254',\n",
       "  'R-HSA-9036289'],\n",
       " 'R-HSA-9678108': [],\n",
       " 'R-HSA-5609975': [],\n",
       " 'R-HSA-5619062': ['R-HSA-5625015'],\n",
       " 'R-HSA-5683826': ['R-HSA-5686359',\n",
       "  'R-HSA-5685201',\n",
       "  'R-HSA-5685649',\n",
       "  'R-HSA-9624789',\n",
       "  'R-HSA-5686301',\n",
       "  'R-HSA-5685208',\n",
       "  'R-HSA-427656',\n",
       "  'R-HSA-6791016',\n",
       "  'R-HSA-5684868',\n",
       "  'R-HSA-5683714',\n",
       "  'R-HSA-5683840',\n",
       "  'R-HSA-5684864',\n",
       "  'R-HSA-5684865',\n",
       "  'R-HSA-9624778',\n",
       "  'R-HSA-5685902',\n",
       "  'R-HSA-5686286',\n",
       "  'R-HSA-5683831',\n",
       "  'R-HSA-5687284',\n",
       "  'R-HSA-5685296',\n",
       "  'R-HSA-5683888',\n",
       "  'R-HSA-5684862',\n",
       "  'R-HSA-5686335',\n",
       "  'R-HSA-5683836',\n",
       "  'R-HSA-418925',\n",
       "  'R-HSA-5683879',\n",
       "  'R-HSA-5693346',\n",
       "  'R-HSA-8961021',\n",
       "  'R-HSA-5686304',\n",
       "  'R-HSA-5685290'],\n",
       " 'R-HSA-5685938': ['R-HSA-75998',\n",
       "  'R-HSA-5686587',\n",
       "  'R-HSA-5693564',\n",
       "  'R-HSA-5693580',\n",
       "  'R-HSA-5686657',\n",
       "  'R-HSA-5686642',\n",
       "  'R-HSA-5686663'],\n",
       " 'R-HSA-9673766': ['R-HSA-9673756', 'R-HSA-9673757'],\n",
       " 'R-HSA-5620922': ['R-HSA-5624126',\n",
       "  'R-HSA-5624127',\n",
       "  'R-HSA-5624125',\n",
       "  'R-HSA-5624129',\n",
       "  'R-HSA-5617815'],\n",
       " 'R-HSA-5083625': ['R-HSA-5096537'],\n",
       " 'R-HSA-5579004': ['R-HSA-5602050'],\n",
       " 'R-HSA-5619109': ['R-HSA-5659764'],\n",
       " 'R-HSA-3828062': ['R-HSA-3828061'],\n",
       " 'R-HSA-9660537': [],\n",
       " 'R-HSA-5655799': ['R-HSA-5655760'],\n",
       " 'R-HSA-5619049': ['R-HSA-5655733'],\n",
       " 'R-HSA-1236394': ['R-HSA-9612593',\n",
       "  'R-HSA-1250315',\n",
       "  'R-HSA-1977958',\n",
       "  'R-HSA-1977959',\n",
       "  'R-HSA-1236398',\n",
       "  'R-HSA-9612639',\n",
       "  'R-HSA-1250220'],\n",
       " 'R-HSA-8867667': [],\n",
       " 'R-HSA-1482798': ['R-HSA-1482857',\n",
       "  'R-HSA-1482794',\n",
       "  'R-HSA-1482778',\n",
       "  'R-HSA-1482861',\n",
       "  'R-HSA-1482781',\n",
       "  'R-HSA-1482860',\n",
       "  'R-HSA-1482894',\n",
       "  'R-HSA-1482867',\n",
       "  'R-HSA-1482850',\n",
       "  'R-HSA-1482773',\n",
       "  'R-HSA-1482759',\n",
       "  'R-HSA-1482775'],\n",
       " 'R-HSA-5619098': ['R-HSA-5638222'],\n",
       " 'R-HSA-5619087': ['R-HSA-5623705'],\n",
       " 'R-HSA-5619104': ['R-HSA-5623588'],\n",
       " 'R-HSA-5619054': ['R-HSA-5656219'],\n",
       " 'R-HSA-5619050': ['R-HSA-5656248'],\n",
       " 'R-HSA-9657688': [],\n",
       " 'R-HSA-9651496': [],\n",
       " 'R-HSA-5210891': ['R-HSA-5210932',\n",
       "  'R-HSA-5210935',\n",
       "  'R-HSA-5211224',\n",
       "  'R-HSA-5211387',\n",
       "  'R-HSA-5211356',\n",
       "  'R-HSA-5210909',\n",
       "  'R-HSA-5211391',\n",
       "  'R-HSA-5210943',\n",
       "  'R-HSA-5210944',\n",
       "  'R-HSA-5210912',\n",
       "  'R-HSA-5210947',\n",
       "  'R-HSA-5210918',\n",
       "  'R-HSA-5211400',\n",
       "  'R-HSA-5210921',\n",
       "  'R-HSA-5210923',\n",
       "  'R-HSA-5211340',\n",
       "  'R-HSA-5210892',\n",
       "  'R-HSA-5211405',\n",
       "  'R-HSA-5210959'],\n",
       " 'R-HSA-9018677': ['R-HSA-9024983',\n",
       "  'R-HSA-9020261',\n",
       "  'R-HSA-9020274',\n",
       "  'R-HSA-9020275',\n",
       "  'R-HSA-9024881'],\n",
       " 'R-HSA-5685939': ['R-HSA-5685953',\n",
       "  'R-HSA-3785768',\n",
       "  'R-HSA-5687673',\n",
       "  'R-HSA-5687465',\n",
       "  'R-HSA-5687640',\n",
       "  'R-HSA-5687464',\n",
       "  'R-HSA-5687675',\n",
       "  'R-HSA-5687484',\n",
       "  'R-HSA-5687664',\n",
       "  'R-HSA-5687653'],\n",
       " 'R-HSA-430116': ['R-HSA-430073',\n",
       "  'R-HSA-443418',\n",
       "  'R-HSA-443402',\n",
       "  'R-HSA-430076',\n",
       "  'R-HSA-443439',\n",
       "  'R-HSA-430096',\n",
       "  'R-HSA-443831'],\n",
       " 'R-HSA-5655332': [],\n",
       " 'R-HSA-8853338': ['R-HSA-5655289',\n",
       "  'R-HSA-5655243',\n",
       "  'R-HSA-5655277',\n",
       "  'R-HSA-5655244',\n",
       "  'R-HSA-5655247',\n",
       "  'R-HSA-5655295',\n",
       "  'R-HSA-5655262',\n",
       "  'R-HSA-5655315',\n",
       "  'R-HSA-5655285',\n",
       "  'R-HSA-5655270'],\n",
       " 'R-HSA-5432849': [],\n",
       " 'R-HSA-5679090': ['R-HSA-5679101'],\n",
       " 'R-HSA-75205': ['R-HSA-159005',\n",
       "  'R-HSA-158941',\n",
       "  'R-HSA-158781',\n",
       "  'R-HSA-158942',\n",
       "  'R-HSA-158750',\n",
       "  'R-HSA-159001',\n",
       "  'R-HSA-158744',\n",
       "  'R-HSA-158747',\n",
       "  'R-HSA-158800',\n",
       "  'R-HSA-158925',\n",
       "  'R-HSA-158893',\n",
       "  'R-HSA-158959',\n",
       "  'R-HSA-158766',\n",
       "  'R-HSA-158795',\n",
       "  'R-HSA-158756',\n",
       "  'R-HSA-158982',\n",
       "  'R-HSA-158721',\n",
       "  'R-HSA-158784',\n",
       "  'R-HSA-158722'],\n",
       " 'R-HSA-2396079': [],\n",
       " 'R-HSA-9015379': [],\n",
       " 'R-HSA-9015122': [],\n",
       " 'R-HSA-9026967': [],\n",
       " 'R-HSA-9671555': [],\n",
       " 'R-HSA-1474290': [],\n",
       " 'R-HSA-194138': ['R-HSA-9674532'],\n",
       " 'R-HSA-3299685': ['R-HSA-3322995',\n",
       "  'R-HSA-3341296',\n",
       "  'R-HSA-71682',\n",
       "  'R-HSA-3697855',\n",
       "  'R-HSA-3780979',\n",
       "  'R-HSA-3779381',\n",
       "  'R-HSA-3299682',\n",
       "  'R-HSA-3299680',\n",
       "  'R-HSA-5696197',\n",
       "  'R-HSA-1222407',\n",
       "  'R-HSA-3697838',\n",
       "  'R-HSA-3323050',\n",
       "  'R-HSA-3299691',\n",
       "  'R-HSA-3299753',\n",
       "  'R-HSA-3341294',\n",
       "  'R-HSA-3697894',\n",
       "  'R-HSA-3777112',\n",
       "  'R-HSA-6807557',\n",
       "  'R-HSA-3697882',\n",
       "  'R-HSA-8951723',\n",
       "  'R-HSA-3780958',\n",
       "  'R-HSA-3341397',\n",
       "  'R-HSA-3343700',\n",
       "  'R-HSA-6799695',\n",
       "  'R-HSA-3341343',\n",
       "  'R-HSA-3341277',\n",
       "  'R-HSA-73646',\n",
       "  'R-HSA-3323079',\n",
       "  'R-HSA-3323013',\n",
       "  'R-HSA-1222376',\n",
       "  'R-HSA-3697860',\n",
       "  'R-HSA-4837364',\n",
       "  'R-HSA-71676',\n",
       "  'R-HSA-76031'],\n",
       " 'R-HSA-162582': [],\n",
       " 'R-HSA-1474151': ['R-HSA-1474184',\n",
       "  'R-HSA-1497866',\n",
       "  'R-HSA-1497869',\n",
       "  'R-HSA-1474158',\n",
       "  'R-HSA-1497824',\n",
       "  'R-HSA-1497794',\n",
       "  'R-HSA-1474146',\n",
       "  'R-HSA-1497796',\n",
       "  'R-HSA-1497863',\n",
       "  'R-HSA-1497784',\n",
       "  'R-HSA-1497883',\n",
       "  'R-HSA-1497853',\n",
       "  'R-HSA-1497855',\n",
       "  'R-HSA-1475422',\n",
       "  'R-HSA-1475414'],\n",
       " 'R-HSA-1296052': ['R-HSA-1296037', 'R-HSA-1296039', 'R-HSA-1296035'],\n",
       " 'R-HSA-1296025': ['R-HSA-1369017', 'R-HSA-1296024'],\n",
       " 'R-HSA-202131': [],\n",
       " 'R-HSA-5619111': ['R-HSA-5625123'],\n",
       " 'R-HSA-5579032': ['R-HSA-5603275'],\n",
       " 'R-HSA-5619068': ['R-HSA-5632871'],\n",
       " 'R-HSA-2470946': ['R-HSA-2468040', 'R-HSA-2470935'],\n",
       " 'R-HSA-2206307': ['R-HSA-9036050', 'R-HSA-2263444'],\n",
       " 'R-HSA-4043916': ['R-HSA-3781832'],\n",
       " 'R-HSA-5693565': ['R-HSA-5693540',\n",
       "  'R-HSA-5682967',\n",
       "  'R-HSA-5683735',\n",
       "  'R-HSA-69891',\n",
       "  'R-HSA-5682965',\n",
       "  'R-HSA-5683986',\n",
       "  'R-HSA-5683792',\n",
       "  'R-HSA-5693598',\n",
       "  'R-HSA-5682588',\n",
       "  'R-HSA-5683930',\n",
       "  'R-HSA-5682586',\n",
       "  'R-HSA-5683801',\n",
       "  'R-HSA-5682629',\n",
       "  'R-HSA-5683077',\n",
       "  'R-HSA-5659781',\n",
       "  'R-HSA-5693583',\n",
       "  'R-HSA-5683405',\n",
       "  'R-HSA-5686578',\n",
       "  'R-HSA-5682992',\n",
       "  'R-HSA-5693566',\n",
       "  'R-HSA-5683774',\n",
       "  'R-HSA-5683967',\n",
       "  'R-HSA-5683964',\n",
       "  'R-HSA-5683384',\n",
       "  'R-HSA-5683385',\n",
       "  'R-HSA-5682598',\n",
       "  'R-HSA-5682983',\n",
       "  'R-HSA-5693602',\n",
       "  'R-HSA-5693536',\n",
       "  'R-HSA-5683425',\n",
       "  'R-HSA-5682607',\n",
       "  'R-HSA-5682863',\n",
       "  'R-HSA-5693551',\n",
       "  'R-HSA-5693549',\n",
       "  'R-HSA-5682858',\n",
       "  'R-HSA-5693609'],\n",
       " 'R-HSA-9671793': [],\n",
       " 'R-HSA-9008177': [],\n",
       " 'R-HSA-5655343': [],\n",
       " 'R-HSA-9008188': [],\n",
       " 'R-HSA-8963896': ['R-HSA-349657',\n",
       "  'R-HSA-216756',\n",
       "  'R-HSA-216757',\n",
       "  'R-HSA-216727',\n",
       "  'R-HSA-5682101',\n",
       "  'R-HSA-5682084',\n",
       "  'R-HSA-264758',\n",
       "  'R-HSA-5682103',\n",
       "  'R-HSA-216723'],\n",
       " 'R-HSA-5679096': ['R-HSA-5679145'],\n",
       " 'R-HSA-193807': ['R-HSA-193821',\n",
       "  'R-HSA-193801',\n",
       "  'R-HSA-193832',\n",
       "  'R-HSA-193800',\n",
       "  'R-HSA-193816',\n",
       "  'R-HSA-192123',\n",
       "  'R-HSA-193845',\n",
       "  'R-HSA-191972',\n",
       "  'R-HSA-193812',\n",
       "  'R-HSA-193841',\n",
       "  'R-HSA-193808',\n",
       "  'R-HSA-193824'],\n",
       " 'R-HSA-1369062': ['R-HSA-382553',\n",
       "  'R-HSA-5682285',\n",
       "  'R-HSA-382575',\n",
       "  'R-HSA-1369052',\n",
       "  'R-HSA-1454928',\n",
       "  'R-HSA-266082',\n",
       "  'R-HSA-5683714',\n",
       "  'R-HSA-265783',\n",
       "  'R-HSA-8848053',\n",
       "  'R-HSA-382613',\n",
       "  'R-HSA-1369028'],\n",
       " 'R-HSA-8964058': ['R-HSA-266299',\n",
       "  'R-HSA-266328',\n",
       "  'R-HSA-266303',\n",
       "  'R-HSA-349404',\n",
       "  'R-HSA-264689',\n",
       "  'R-HSA-264695',\n",
       "  'R-HSA-266315',\n",
       "  'R-HSA-8980228',\n",
       "  'R-HSA-266089',\n",
       "  'R-HSA-266082',\n",
       "  'R-HSA-264679',\n",
       "  'R-HSA-266310',\n",
       "  'R-HSA-264678'],\n",
       " 'R-HSA-5652084': [],\n",
       " 'R-HSA-9630747': [],\n",
       " 'R-HSA-5578996': ['R-HSA-5602170', 'R-HSA-9035960'],\n",
       " 'R-HSA-2173782': [],\n",
       " 'R-HSA-5686938': ['R-HSA-5432814',\n",
       "  'R-HSA-5432825',\n",
       "  'R-HSA-6805981',\n",
       "  'R-HSA-8869694',\n",
       "  'R-HSA-5432852',\n",
       "  'R-HSA-8869667',\n",
       "  'R-HSA-8869683',\n",
       "  'R-HSA-6804099',\n",
       "  'R-HSA-5432849',\n",
       "  'R-HSA-6804100',\n",
       "  'R-HSA-8870678',\n",
       "  'R-HSA-6805943'],\n",
       " 'R-HSA-9675132': [],\n",
       " 'R-HSA-1592389': ['R-HSA-1602458',\n",
       "  'R-HSA-1604763',\n",
       "  'R-HSA-1592349',\n",
       "  'R-HSA-1604368',\n",
       "  'R-HSA-1604752',\n",
       "  'R-HSA-1604690',\n",
       "  'R-HSA-1602454',\n",
       "  'R-HSA-1592278',\n",
       "  'R-HSA-1604360',\n",
       "  'R-HSA-1592398',\n",
       "  'R-HSA-1605825',\n",
       "  'R-HSA-1604741',\n",
       "  'R-HSA-1604359',\n",
       "  'R-HSA-1602488',\n",
       "  'R-HSA-1604731',\n",
       "  'R-HSA-1592316',\n",
       "  'R-HSA-1604732',\n",
       "  'R-HSA-1604350',\n",
       "  'R-HSA-1604722',\n",
       "  'R-HSA-1592371',\n",
       "  'R-HSA-1592436',\n",
       "  'R-HSA-1602484',\n",
       "  'R-HSA-1604712',\n",
       "  'R-HSA-1602473',\n",
       "  'R-HSA-1592297',\n",
       "  'R-HSA-1592362',\n",
       "  'R-HSA-1602466'],\n",
       " 'R-HSA-879415': ['R-HSA-879362',\n",
       "  'R-HSA-879411',\n",
       "  'R-HSA-879377',\n",
       "  'R-HSA-879358'],\n",
       " 'R-HSA-9673324': ['R-HSA-9673789',\n",
       "  'R-HSA-9673288',\n",
       "  'R-HSA-9673322',\n",
       "  'R-HSA-9673284',\n",
       "  'R-HSA-9673797',\n",
       "  'R-HSA-9673349',\n",
       "  'R-HSA-9673296',\n",
       "  'R-HSA-9673794',\n",
       "  'R-HSA-9673346'],\n",
       " 'R-HSA-1234174': ['R-HSA-1234164'],\n",
       " 'R-HSA-1234158': ['R-HSA-1235037',\n",
       "  'R-HSA-1235070',\n",
       "  'R-HSA-1235035',\n",
       "  'R-HSA-1234171',\n",
       "  'R-HSA-1234167',\n",
       "  'R-HSA-1234161',\n",
       "  'R-HSA-8932184'],\n",
       " 'R-HSA-1234176': ['R-HSA-1234173',\n",
       "  'R-HSA-1234172',\n",
       "  'R-HSA-1234159',\n",
       "  'R-HSA-1234175',\n",
       "  'R-HSA-1234169',\n",
       "  'R-HSA-1234165',\n",
       "  'R-HSA-1234181',\n",
       "  'R-HSA-1234183',\n",
       "  'R-HSA-1234166',\n",
       "  'R-HSA-1234177',\n",
       "  'R-HSA-1234163',\n",
       "  'R-HSA-1234179'],\n",
       " 'R-HSA-8849473': ['R-HSA-8848812', 'R-HSA-8856930', 'R-HSA-8848804'],\n",
       " 'R-HSA-8934903': ['R-HSA-8948039',\n",
       "  'R-HSA-8959573',\n",
       "  'R-HSA-8959571',\n",
       "  'R-HSA-8948146',\n",
       "  'R-HSA-8948143',\n",
       "  'R-HSA-8948139',\n",
       "  'R-HSA-8948136'],\n",
       " 'R-HSA-6803204': ['R-HSA-3700984',\n",
       "  'R-HSA-4331331',\n",
       "  'R-HSA-6801250',\n",
       "  'R-HSA-6798624',\n",
       "  'R-HSA-6801184',\n",
       "  'R-HSA-139913',\n",
       "  'R-HSA-6801195',\n",
       "  'R-HSA-3700981',\n",
       "  'R-HSA-4331340',\n",
       "  'R-HSA-6797993',\n",
       "  'R-HSA-6791285',\n",
       "  'R-HSA-6798004',\n",
       "  'R-HSA-6801213',\n",
       "  'R-HSA-6791291',\n",
       "  'R-HSA-6799418',\n",
       "  'R-HSA-6799097',\n",
       "  'R-HSA-6801209',\n",
       "  'R-HSA-6799416',\n",
       "  'R-HSA-6791302',\n",
       "  'R-HSA-6801166',\n",
       "  'R-HSA-6791306',\n",
       "  'R-HSA-6798615',\n",
       "  'R-HSA-140214',\n",
       "  'R-HSA-6798611',\n",
       "  'R-HSA-6801242'],\n",
       " 'R-HSA-8848021': [],\n",
       " 'R-HSA-2122947': ['R-HSA-9667638',\n",
       "  'R-HSA-4396371',\n",
       "  'R-HSA-1980078',\n",
       "  'R-HSA-1980047',\n",
       "  'R-HSA-1912396',\n",
       "  'R-HSA-1852623',\n",
       "  'R-HSA-1912393',\n",
       "  'R-HSA-1912394',\n",
       "  'R-HSA-4396347',\n",
       "  'R-HSA-4396379',\n",
       "  'R-HSA-1912388',\n",
       "  'R-HSA-1912359',\n",
       "  'R-HSA-1912391',\n",
       "  'R-HSA-9667657',\n",
       "  'R-HSA-1912385',\n",
       "  'R-HSA-1980067',\n",
       "  'R-HSA-4396382',\n",
       "  'R-HSA-1980065'],\n",
       " 'R-HSA-8939902': ['R-HSA-8985293',\n",
       "  'R-HSA-9008076',\n",
       "  'R-HSA-9007759',\n",
       "  'R-HSA-9008015',\n",
       "  'R-HSA-9016526',\n",
       "  'R-HSA-8939904',\n",
       "  'R-HSA-8940032',\n",
       "  'R-HSA-9007686',\n",
       "  'R-HSA-9008345',\n",
       "  'R-HSA-8939929',\n",
       "  'R-HSA-8939801',\n",
       "  'R-HSA-9007707',\n",
       "  'R-HSA-9008475',\n",
       "  'R-HSA-9009309',\n",
       "  'R-HSA-9008476',\n",
       "  'R-HSA-9009308',\n",
       "  'R-HSA-9008479',\n",
       "  'R-HSA-9008478',\n",
       "  'R-HSA-9009362',\n",
       "  'R-HSA-8939688',\n",
       "  'R-HSA-9009451',\n",
       "  'R-HSA-9009452',\n",
       "  'R-HSA-9008110',\n",
       "  'R-HSA-9008480',\n",
       "  'R-HSA-8939938',\n",
       "  'R-HSA-9008036',\n",
       "  'R-HSA-9009401',\n",
       "  'R-HSA-9009403',\n",
       "  'R-HSA-8939706',\n",
       "  'R-HSA-9009085',\n",
       "  'R-HSA-8939900',\n",
       "  'R-HSA-9007999'],\n",
       " 'R-HSA-452723': ['R-HSA-2889036',\n",
       "  'R-HSA-452838',\n",
       "  'R-HSA-2972968',\n",
       "  'R-HSA-500366',\n",
       "  'R-HSA-480301',\n",
       "  'R-HSA-480685',\n",
       "  'R-HSA-480204',\n",
       "  'R-HSA-452392',\n",
       "  'R-HSA-2895778',\n",
       "  'R-HSA-480520',\n",
       "  'R-HSA-1112609',\n",
       "  'R-HSA-452894'],\n",
       " 'R-HSA-2559580': ['R-HSA-182594',\n",
       "  'R-HSA-3228469',\n",
       "  'R-HSA-3225851',\n",
       "  'R-HSA-168136',\n",
       "  'R-HSA-3240765',\n",
       "  'R-HSA-3240957',\n",
       "  'R-HSA-3240766',\n",
       "  'R-HSA-3209151',\n",
       "  'R-HSA-3229089',\n",
       "  'R-HSA-3229152',\n",
       "  'R-HSA-3223200',\n",
       "  'R-HSA-450325',\n",
       "  'R-HSA-3240295',\n",
       "  'R-HSA-3239014',\n",
       "  'R-HSA-3239019',\n",
       "  'R-HSA-450333',\n",
       "  'R-HSA-3229102',\n",
       "  'R-HSA-168162',\n",
       "  'R-HSA-6804998',\n",
       "  'R-HSA-3240787',\n",
       "  'R-HSA-3229138',\n",
       "  'R-HSA-3222546',\n",
       "  'R-HSA-6804996',\n",
       "  'R-HSA-3238999',\n",
       "  'R-HSA-3209111',\n",
       "  'R-HSA-450222',\n",
       "  'R-HSA-6804879',\n",
       "  'R-HSA-450348',\n",
       "  'R-HSA-3209114',\n",
       "  'R-HSA-3222593',\n",
       "  'R-HSA-450292',\n",
       "  'R-HSA-3222533',\n",
       "  'R-HSA-3223236',\n",
       "  'R-HSA-8979071',\n",
       "  'R-HSA-3240777',\n",
       "  'R-HSA-3225867',\n",
       "  'R-HSA-9645672',\n",
       "  'R-HSA-450296',\n",
       "  'R-HSA-3240783',\n",
       "  'R-HSA-3240782'],\n",
       " 'R-HSA-8857538': ['R-HSA-8857577',\n",
       "  'R-HSA-9634702',\n",
       "  'R-HSA-8857565',\n",
       "  'R-HSA-8857549',\n",
       "  'R-HSA-8857583',\n",
       "  'R-HSA-8857555'],\n",
       " 'R-HSA-2262752': [],\n",
       " 'R-HSA-8953897': [],\n",
       " 'R-HSA-1980143': [],\n",
       " 'R-HSA-5633008': [],\n",
       " 'R-HSA-6806834': [],\n",
       " 'R-HSA-8964572': ['R-HSA-8862380',\n",
       "  'R-HSA-8858270',\n",
       "  'R-HSA-8857686',\n",
       "  'R-HSA-8856630'],\n",
       " 'R-HSA-8862803': ['R-HSA-8868344',\n",
       "  'R-HSA-8868666',\n",
       "  'R-HSA-8863674',\n",
       "  'R-HSA-8868573',\n",
       "  'R-HSA-8870686',\n",
       "  'R-HSA-8870558',\n",
       "  'R-HSA-8863007',\n",
       "  'R-HSA-8868340',\n",
       "  'R-HSA-8870710',\n",
       "  'R-HSA-8868567',\n",
       "  'R-HSA-8870698',\n",
       "  'R-HSA-8870703',\n",
       "  'R-HSA-8863008',\n",
       "  'R-HSA-8863009',\n",
       "  'R-HSA-8863587',\n",
       "  'R-HSA-8863011',\n",
       "  'R-HSA-8870628',\n",
       "  'R-HSA-8868260',\n",
       "  'R-HSA-8863012',\n",
       "  'R-HSA-8863013',\n",
       "  'R-HSA-8863014',\n",
       "  'R-HSA-8868134'],\n",
       " 'R-HSA-8941858': ['R-HSA-8937814',\n",
       "  'R-HSA-8952419',\n",
       "  'R-HSA-8952371',\n",
       "  'R-HSA-8865454',\n",
       "  'R-HSA-8937792',\n",
       "  'R-HSA-8952399',\n",
       "  'R-HSA-8937807',\n",
       "  'R-HSA-8952382',\n",
       "  'R-HSA-8952408'],\n",
       " 'R-HSA-72613': [],\n",
       " 'R-HSA-3371556': [],\n",
       " 'R-HSA-109582': [],\n",
       " 'R-HSA-210990': ['R-HSA-210285',\n",
       "  'R-HSA-210283',\n",
       "  'R-HSA-210277',\n",
       "  'R-HSA-210294',\n",
       "  'R-HSA-210304',\n",
       "  'R-HSA-210290',\n",
       "  'R-HSA-210291'],\n",
       " 'R-HSA-9662001': [],\n",
       " 'R-HSA-392154': ['R-HSA-392152', 'R-HSA-392143', 'R-HSA-418436'],\n",
       " 'R-HSA-9020933': ['R-HSA-8952823',\n",
       "  'R-HSA-8950583',\n",
       "  'R-HSA-8950183',\n",
       "  'R-HSA-8950741',\n",
       "  'R-HSA-8950724',\n",
       "  'R-HSA-447130',\n",
       "  'R-HSA-8950737',\n",
       "  'R-HSA-8950591',\n",
       "  'R-HSA-8950269',\n",
       "  'R-HSA-8952749',\n",
       "  'R-HSA-8950780',\n",
       "  'R-HSA-8950364'],\n",
       " 'R-HSA-3318486': [],\n",
       " 'R-HSA-9668250': [],\n",
       " 'R-HSA-9603302': [],\n",
       " 'R-HSA-9015111': [],\n",
       " 'R-HSA-111919': [],\n",
       " 'R-HSA-76002': [],\n",
       " 'R-HSA-3595174': ['R-HSA-3636919'],\n",
       " 'R-HSA-3560783': ['R-HSA-3560804'],\n",
       " 'R-HSA-4420332': ['R-HSA-4420365'],\n",
       " 'R-HSA-2033515': ['R-HSA-2038386', 'R-HSA-2038387'],\n",
       " 'R-HSA-2033514': ['R-HSA-2077420'],\n",
       " 'R-HSA-5655291': ['R-HSA-5655336',\n",
       "  'R-HSA-5655341',\n",
       "  'R-HSA-5655313',\n",
       "  'R-HSA-5655248',\n",
       "  'R-HSA-5655235',\n",
       "  'R-HSA-5655347',\n",
       "  'R-HSA-5655252',\n",
       "  'R-HSA-5655348',\n",
       "  'R-HSA-5655284',\n",
       "  'R-HSA-5655351'],\n",
       " 'R-HSA-190239': [],\n",
       " 'R-HSA-1839130': ['R-HSA-2012082',\n",
       "  'R-HSA-2033476',\n",
       "  'R-HSA-2012084',\n",
       "  'R-HSA-2012073',\n",
       "  'R-HSA-2012074',\n",
       "  'R-HSA-2033485'],\n",
       " 'R-HSA-9648895': ['R-HSA-9653742',\n",
       "  'R-HSA-9655086',\n",
       "  'R-HSA-9654792',\n",
       "  'R-HSA-9635912',\n",
       "  'R-HSA-9635915',\n",
       "  'R-HSA-9653893',\n",
       "  'R-HSA-1791118',\n",
       "  'R-HSA-9653894',\n",
       "  'R-HSA-9654752',\n",
       "  'R-HSA-9650722',\n",
       "  'R-HSA-9653724',\n",
       "  'R-HSA-381128',\n",
       "  'R-HSA-9655071',\n",
       "  'R-HSA-9648888',\n",
       "  'R-HSA-9654774',\n",
       "  'R-HSA-9650710',\n",
       "  'R-HSA-9635927',\n",
       "  'R-HSA-9648880',\n",
       "  'R-HSA-9653745',\n",
       "  'R-HSA-9648883'],\n",
       " 'R-HSA-5690338': ['R-HSA-5690340'],\n",
       " 'R-HSA-69563': ['R-HSA-187934', 'R-HSA-69562'],\n",
       " 'R-HSA-5693548': ['R-HSA-5684008',\n",
       "  'R-HSA-5682044',\n",
       "  'R-HSA-5693612',\n",
       "  'R-HSA-75174',\n",
       "  'R-HSA-75172',\n",
       "  'R-HSA-5693540',\n",
       "  'R-HSA-3785768',\n",
       "  'R-HSA-3785704',\n",
       "  'R-HSA-5684006'],\n",
       " 'R-HSA-6804756': ['R-HSA-6805479',\n",
       "  'R-HSA-6798374',\n",
       "  'R-HSA-3222128',\n",
       "  'R-HSA-6798373',\n",
       "  'R-HSA-6805285',\n",
       "  'R-HSA-6799332',\n",
       "  'R-HSA-6798372',\n",
       "  'R-HSA-3222006',\n",
       "  'R-HSA-6805103',\n",
       "  'R-HSA-6805035',\n",
       "  'R-HSA-6805109',\n",
       "  'R-HSA-6799409',\n",
       "  'R-HSA-3239014',\n",
       "  'R-HSA-6799431',\n",
       "  'R-HSA-6805126',\n",
       "  'R-HSA-3215251',\n",
       "  'R-HSA-6805061',\n",
       "  'R-HSA-6805059',\n",
       "  'R-HSA-6805122',\n",
       "  'R-HSA-6799246',\n",
       "  'R-HSA-6805399',\n",
       "  'R-HSA-69685',\n",
       "  'R-HSA-3222020',\n",
       "  'R-HSA-6805470',\n",
       "  'R-HSA-6805276',\n",
       "  'R-HSA-5693609'],\n",
       " 'R-HSA-5579017': ['R-HSA-5580292'],\n",
       " 'R-HSA-5579028': ['R-HSA-9035956', 'R-HSA-9035954', 'R-HSA-5601843'],\n",
       " 'R-HSA-418925': [],\n",
       " 'R-HSA-5579000': ['R-HSA-5605147'],\n",
       " 'R-HSA-2681681': []}"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "path_reac"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1277"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "stat = {}\n",
    "for i in path_reac:\n",
    "    for j in path_reac[i]:\n",
    "        temp = j\n",
    "        if temp not in stat:\n",
    "            stat[temp] = 1\n",
    "        else:\n",
    "            stat[temp] += 1\n",
    "len(stat)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Find the preceding-reaction of each pathway"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "R-HSA-9008694   R-HSA-9012689\n",
      "R-HSA-9009910   R-HSA-9012689\n",
      "R-HSA-9008692   R-HSA-9009910\n",
      "R-HSA-9008692   R-HSA-9012689\n",
      "R-HSA-9009072   R-HSA-9008577\n",
      "R-HSA-9012689   R-HSA-9012556\n",
      "R-HSA-9008894   R-HSA-9008928\n",
      "R-HSA-9012542   R-HSA-9012689\n",
      "R-HSA-9008696   R-HSA-9012689\n",
      "R-HSA-9008928   R-HSA-9009910\n",
      "R-HSA-9008577   R-HSA-8848335\n",
      "R-HSA-8848335   R-HSA-9008694\n",
      "R-HSA-9008684   R-HSA-9008577\n",
      "R-HSA-9012556   R-HSA-9012542\n",
      "R-HSA-9008587   R-HSA-9008694\n"
     ]
    }
   ],
   "source": [
    "query = 'MATCH (n:Pathway) WHERE n.stId = \\'R-HSA-9008059\\''+\\\n",
    "        ' WITH n MATCH (n) -[r]- (m:ReactionLikeEvent)'+\\\n",
    "        'WITH m MATCH (m) -[t:precedingEvent]-> (u) RETURN m.stId,t,u.stId'\n",
    "with driver.session() as session:\n",
    "    info = session.run(query)\n",
    "    pre = []\n",
    "    lat = []\n",
    "    num = []\n",
    "    for item in info:\n",
    "        pre.append(item.values()[0])\n",
    "        lat.append(item.values()[2])\n",
    "        #print(item.values()[0],item.values()[2])\n",
    "    #for i in range(len(pre)):\n",
    "    #    if lat[i] not in pre:\n",
    "    #        pre[i] = 'null'\n",
    "    #        lat[i] = 'null'\n",
    "\n",
    "for i in range(len(pre)):\n",
    "    print(pre[i], ' ', lat[i])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "stat = pd.DataFrame.from_dict(stat, orient = 'index', columns=['numbers'])\n",
    "stat = stat.reset_index().rename(columns = {'index':'Name'})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Name</th>\n",
       "      <th>numbers</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>878</th>\n",
       "      <td>R-HSA-5693609</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1107</th>\n",
       "      <td>R-HSA-3239014</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>906</th>\n",
       "      <td>R-HSA-266082</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>453</th>\n",
       "      <td>R-HSA-71682</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>296</th>\n",
       "      <td>R-HSA-9646295</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "               Name  numbers\n",
       "878   R-HSA-5693609        2\n",
       "1107  R-HSA-3239014        2\n",
       "906    R-HSA-266082        2\n",
       "453     R-HSA-71682        2\n",
       "296   R-HSA-9646295        2"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "stat.sort_values('numbers',ascending=False).head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 65,
   "metadata": {},
   "outputs": [],
   "source": [
    "stat.to_csv('./pathway_reaction.csv')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Total number of reaction related to pathway in Neo4j"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1277"
      ]
     },
     "execution_count": 66,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(reac)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "metadata": {},
   "outputs": [],
   "source": [
    "dic_reaction = np.load('./dicCVD_reaction_neo4j.npy', allow_pickle=True).item()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "metadata": {},
   "outputs": [],
   "source": [
    "tp = []\n",
    "for i in dic_reaction:\n",
    "    for j in dic_reaction[i]:\n",
    "        if j not in tp:\n",
    "            tp.append(j)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Total number of reaction from website"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "384"
      ]
     },
     "execution_count": 69,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(tp)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "metadata": {},
   "outputs": [],
   "source": [
    "c = 0\n",
    "for i in reac:\n",
    "    if i in tp:\n",
    "        c += 1\n",
    "    "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### The number of the overlapped reaction"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 71,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "124"
      ]
     },
     "execution_count": 71,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "c"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Relationship with Bioprocess"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "process = []\n",
    "count = 0\n",
    "path_process = {}\n",
    "for i in dic_pathway:\n",
    "    for j in dic_pathway[i]:\n",
    "        path_process[j] = []\n",
    "        query = 'MATCH (n:Pathway) WHERE n.stId =\\'' + j +\\\n",
    "                '\\' WITH n MATCH (n:Pathway) -[r]- (m:GO_BiologicalProcess) RETURN m.displayName'\n",
    "        #print(query)\n",
    "        with driver.session() as session:\n",
    "            info = session.run(query)\n",
    "            for item in info:\n",
    "                path_process[j].append(item.values()[0])\n",
    "                count += 1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "49"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "stat = {}\n",
    "for i in path_process:\n",
    "    for j in path_process[i]:\n",
    "        temp = j\n",
    "        if temp not in stat:\n",
    "            stat[temp] = 1\n",
    "        else:\n",
    "            stat[temp] += 1\n",
    "len(stat)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "stat = pd.DataFrame.from_dict(stat, orient = 'index', columns=['numbers'])\n",
    "stat = stat.reset_index().rename(columns = {'index':'Name'})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Name</th>\n",
       "      <th>numbers</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Notch signaling pathway</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>long-chain fatty acid biosynthetic process</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>regulation of transcription by RNA polymerase II</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>cellular response to cytokine stimulus</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>cellular response to stress</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                                Name  numbers\n",
       "10                           Notch signaling pathway        3\n",
       "1         long-chain fatty acid biosynthetic process        2\n",
       "9   regulation of transcription by RNA polymerase II        2\n",
       "0             cellular response to cytokine stimulus        1\n",
       "37                       cellular response to stress        1"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "stat.sort_values('numbers',ascending=False).head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Relationship with CellularComponet"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "count = 0\n",
    "path_cell = {}\n",
    "for i in dic_pathway:\n",
    "    for j in dic_pathway[i]:\n",
    "        path_cell[j] = []\n",
    "        query = 'MATCH (n:Pathway) WHERE n.stId =\\'' + j +\\\n",
    "                '\\' WITH n MATCH (n:Pathway) -[r]- (m:GO_CellularComponent) RETURN m.displayName'\n",
    "        #print(query)\n",
    "        with driver.session() as session:\n",
    "            info = session.run(query)\n",
    "            for item in info:\n",
    "                path_cell[j].append(item.values()[0])\n",
    "                count += 1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "12"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "stat = {}\n",
    "for i in path_cell:\n",
    "    for j in path_cell[i]:\n",
    "        temp = j\n",
    "        if temp not in stat:\n",
    "            stat[temp] = 1\n",
    "        else:\n",
    "            stat[temp] += 1\n",
    "len(stat)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [],
   "source": [
    "stat = pd.DataFrame.from_dict(stat, orient = 'index', columns=['numbers'])\n",
    "stat = stat.reset_index().rename(columns = {'index':'Name'})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Name</th>\n",
       "      <th>numbers</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>cytosol</td>\n",
       "      <td>23</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>plasma membrane</td>\n",
       "      <td>17</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>nucleoplasm</td>\n",
       "      <td>17</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>extracellular region</td>\n",
       "      <td>13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>endoplasmic reticulum membrane</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                             Name  numbers\n",
       "2                         cytosol       23\n",
       "0                 plasma membrane       17\n",
       "3                     nucleoplasm       17\n",
       "1            extracellular region       13\n",
       "4  endoplasmic reticulum membrane        3"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "stat.sort_values('numbers',ascending=False).head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Relationship with Diseases"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "dis = []\n",
    "count = 0\n",
    "path_dis = {}\n",
    "for i in dic_pathway:\n",
    "    for j in dic_pathway[i]:\n",
    "        path_dis[j] = []\n",
    "        query = 'MATCH (n:Pathway) WHERE n.stId =\\'' + j +\\\n",
    "                '\\' WITH n MATCH (n:Pathway) -[r]- (m:Disease) RETURN m.displayName'\n",
    "        #print(query)\n",
    "        with driver.session() as session:\n",
    "            info = session.run(query)\n",
    "            for item in info:\n",
    "                path_dis[j].append(item.values()[0])\n",
    "                count += 1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "64"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "stat = {}\n",
    "for i in path_dis:\n",
    "    for j in path_dis[i]:\n",
    "        temp = j\n",
    "        if temp not in stat:\n",
    "            stat[temp] = 1\n",
    "        else:\n",
    "            stat[temp] += 1\n",
    "len(stat)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [],
   "source": [
    "stat = pd.DataFrame.from_dict(stat, orient = 'index', columns=['numbers'])\n",
    "stat = stat.reset_index().rename(columns = {'index':'Name'})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Name</th>\n",
       "      <th>numbers</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>cancer</td>\n",
       "      <td>21</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>bone development disease</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>primary immunodeficiency disease</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>56</th>\n",
       "      <td>Ehlers-Danlos syndrome</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>renal tubular acidosis</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                Name  numbers\n",
       "15                            cancer       21\n",
       "17          bone development disease        7\n",
       "22  primary immunodeficiency disease        6\n",
       "56            Ehlers-Danlos syndrome        3\n",
       "40            renal tubular acidosis        2"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "stat.sort_values('numbers',ascending=False).head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Relationship with Protein"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [],
   "source": [
    "pro = []\n",
    "count = 0\n",
    "path_pro = {}\n",
    "for i in dic_pathway:\n",
    "    for j in dic_pathway[i]:\n",
    "        path_pro[j] = []\n",
    "        query = 'MATCH (n:Pathway) WHERE n.stId =\\'' + j +\\\n",
    "                '\\' WITH n MATCH (n:Pathway) -[r]- (m:ReferenceEntity) RETURN m.displayName'\n",
    "        #print(query)\n",
    "        with driver.session() as session:\n",
    "            info = session.run(query)\n",
    "            for item in info:\n",
    "                path_pro[j].append(item.values()[0])\n",
    "                count += 1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0"
      ]
     },
     "execution_count": 45,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "stat = {}\n",
    "for i in path_pro:\n",
    "    for j in path_pro[i]:\n",
    "        temp = j\n",
    "        if temp not in stat:\n",
    "            stat[temp] = 1\n",
    "        else:\n",
    "            stat[temp] += 1\n",
    "len(stat)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### About reaction from website"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### relationship with pathway"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "200"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "path = []\n",
    "for i in dic_reaction:\n",
    "    for j in dic_reaction[i]:\n",
    "        query = 'MATCH (n:Reaction) WHERE n.stId =\\'' + j +\\\n",
    "                '\\' WITH n MATCH (n) -[r]- (m:Pathway) RETURN m.stId'\n",
    "        with driver.session() as session:\n",
    "            info = session.run(query)\n",
    "            for item in info:\n",
    "                #print(item.values())\n",
    "                if item.values()[0] not in path:\n",
    "                    path.append(item.values()[0])\n",
    "\n",
    "len(path)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [],
   "source": [
    "tp = []\n",
    "for i in dic_pathway:\n",
    "    for j in dic_pathway[i]:\n",
    "        if j not in tp:\n",
    "            tp.append(j)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "209"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(tp)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [],
   "source": [
    "c = 0\n",
    "for i in path:\n",
    "    if i in tp:\n",
    "        c += 1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### The number of the overlapped pathway"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "46"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "c"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
